<template>
  <HeroBanner
    bgImage="https://res.cloudinary.com/dube3xzga/image/upload/v1749989647/%E6%88%AA%E5%9C%96_2025-06-15_%E6%99%9A%E4%B8%8A8.13.53_cwquya.png"
    emoji="⌨️"
    title="33"
    subtitle=""
  />
  <main class="transition-all duration-[1500ms] ease-in-out mb-20">
    <div class="article-container glass-article">
      <p>
        就從 2024 年 8 月開始回顧吧，那陣子真的很胡鬧，每天 5 點多起床學寫程式，下了班回到家也都在電腦前。因為覺得自己很笨，學了都記不住，想方設法要讓睡眠品質提升（開始怪東怪西 😂），把自己跟小狗們隔離，買了一張凹豆皮的睡墊，睡在升降桌上面，回想起來真的有夠瘋。<br><br>
        當時是在 ALPHA camp 後端專修的最後一個餐廳清單的專案，到了年底，AC 的課都學完了，除了開始思考要寫什麼個人專案作為面試用的作品集之外，也認識了我的 Mentor Hank，有一個資深軟體人帶著自己總是比較安心。跟 Hank 盤點了我會的技能樹跟 GitHub 裡的專案後，他說：「你要不要寫前端。」 and I was like ??????? 其實我當初不想碰前端的原因現在回想起來自己也覺得蠻好笑的，因為在 ALPHA camp 的入門課時，我覺得 CSS 太煩了，我真的真的很怕切版，以及想到要刻的畫面是自己不喜歡的，會不會工作時會感到痛苦？如果是後端，只要弄好資料架構，商業邏輯寫好就好。
        當時 Hank 說了一句我覺得帥到不行的話：
      </p>
      <br>
      <blockquote class="border-l-4 border-zinc-600 pl-4">
        寫程式沒有在管什麼前端後端啦，寫程式就是寫程式。
      </blockquote>
      <br>
      <p>
        後來我就開始點前端的技能樹，至今回想起來，真的打從心臟最底部感謝 Hank，那是 2024 年做過最對的決定之一，腦波很弱大概也是不到 3 分鐘就說：「好啦就寫吧。」<br><br>
        看了一陣子 React 的課程跟官方文件，邊學邊實作，和我的 AC 學伴宥岑一起寫旅遊平台的專案（我也洗腦她開始學前端），那個春節每天都在寫專案，除了吃飯跟睡覺之外都在寫，因為宥岑是護理師，要上夜班，我們同時上線的時間只有一些些，她超拼的，下班吃點東西就開始寫，然後我要去睡覺時就接棒，她寫到清晨去睡覺，她要去上班前我們同步一下之類的。這段期間是我倆最熱血的時候，太懷念了。<br><br>
        其實在透過 AC 預錄的課程自學期間，我真的是體驗不到太多寫程式的快樂，是直到跟宥岑一起寫了這個專案，我才體會到專注建構一個項目的成就感。想實現的功能不知道怎麼做，上網查資料、跟 ChatGPT 討論，再把功能實現，是直到這個階段，我才確認自己喜歡寫程式。不敢說自己「適合」寫程式（但我敢說自己很適合退休），但喜歡一件事，它才能繼續下去甚至作為職涯的一部分對吧？<br><br>
        </p>
      <h3>失業</h3>
      <p>年假過後，我就開始在思考離職跟轉職，現在的公司有讓我利用新的技能貢獻的空間嗎？如果有我該怎麼爭取？如果沒有的話我要帶薪求職還是裸辭？辭職後可以休息多久？甚至是我該休息嗎？還是不該休息呢？要探究離職原因的話，當時的工作內容用 no code 工具幫客戶開發應用程式跟我們開始做模板，在說明會販售時，還是很好玩的，去年我們的開發是經過資訊搜集、提案、客戶買單、開發、交付的，但後來突然改成由我 1 人工廠的面對面開發，理由不外乎是省錢，省人力。<br><br>面對面開發是源自日本 Kintone 的開發方式，簡單來說就是開發者與客戶在同一個空間，客戶說出需求，開發者現場製作應用程式，隨時反饋即時修改的服務，專案沒有一定的結束時間，就看你做到何時，是以小時計費，直到應用程式完成。我心裡一直跟這件事情過不去，很多時候在客戶也不知道自己要什麼的情況下，我們大眼瞪小眼的你一句想法，我即時的做出來，做出來客戶覺得不甚滿意其實都是花費客戶的時間跟金錢，尤其開發的 scope 不斷擴大，或是資料都還沒理清就要這樣子開發，這個過程真的很煎熬。或許在日本 Kintone 他們的模板跟產品都很成熟的情況下是可行的吧，總之很確定我自己非常不適合這樣的工作方式。而且這個 1 人工廠的開發方式是無法商量的，無法回到之前小團隊運作的開發方式。再加上客戶有超過 no code 工具限制之外的需求，公司不太用 coding 的方式開發，基本不能成案，有些覺得有趣的案子都蠻可惜的。我有跟父母討論一下，告知我要離職的決定，請他們不要擔心，在 3 月中我就跟 HR 討論最適合提離職的時機，想著離職後整理一下自己，來探探軟體工程師的職位，看看大齡的我有沒有機會轉職。<br><br>
        最終在 2025 年 4 月 8 日離開公司，最難的是離開我最愛的同事們，每一個都那麼的可愛。在這裡要感謝田中先生，他真的是一個好人，特別在離職時送了一份應有盡有的大禮包，彷彿是怕我在轉職的冒險旅途上太危險，總之我謝謝你了田田。<br>
        <br>
        </p>
        <h3>沉澱</h3>
        <p>離職後的第一週，覺得生活忽然多了一個大空缺，應該很多離開職場的人都會有這樣的感受，我甚至懷疑自己的決定，是不是當初繼續乖乖的上班就好？（我怎麼會這樣想）我幹嘛呢都幾歲了還想什麼轉職。Internal Saboteur Attacks!!! <br><br>
        焦慮、徬徨無助時就去找丹波老師，於是我屁顛屁顛的跑去算命。當丹波老師說服我應該在多年的職涯中休息一下，沉澱自己，尤其去做一些對自己心靈有幫助的事情後，八月後再報到都可以，我便開始認真的放飛自我。想想我從 18 歲開始打工到現在一直都在工作，的確是沒有讓自己休息一下下過，開始規劃去蘭嶼、短期出家、看書、陪我的小狗們，到了五月，平日幾乎每天都去游泳，游泳完在公園裡看松鼠、抱樹、看螞蟻工作，肚子餓了就去覓食，累了就抱著小狗睡午覺。這段期間有學個 Vue 寫了2個小專案跟這個網站（因為當時看了一下，想去的一些公司用 Vue），七月底去內觀中心打坐後去環島，也沒幹嘛就一個城市接著一個城市的前進，環到有點害怕山路。也追了一些早就看過幾百次的美劇，也把這一年半沒看的 drag race 看完了。<br><br>
        身體變得很輕盈，睡覺也很好睡，不吃中藥也睡得很沉，睡眠分數居然都可以在75-85分之間，跟小狗們時刻黏在一起癱在一起，也不用因為要去上班，怕別人聞到我身上的狗味特別洗澡，爽啦。然後發現，沒上班比上班花的錢少很多，有意思。
        </p>
        <br>
        <h3>A full-stack software engineer? me?? 🫨</h3>
        <p>
        約莫是 9 月底開始超前部署(?)來謀職，先丟履歷 → 有面試機會 → 不想搞砸 →有動力去唸書——我是這樣想的。在 104 投了一個禮拜後，居然沒有一家公司要面試我，於是我就開始認真了 😠 
        我開始找求職展，10 月 8 日去了 Cake 的 Career Fair，挨家挨戶的自我介紹，才開始有了許多面試機會，後來也去了 Yourator 的一個活動，不過我失策的一個地方是，我抱持著有機會就試試看的心態陸續投了前端、後端工程師的職位，其中前端的職位有些公司用 Vue 作為技術棧，有些使用 React，所以準備起來非常累人，讀書的投入無法集中力道。比方說我星期一有一個 React 的前端面試，星期三有一個 Vue 的面試，週五有後端的面試，我就需要切換準備內容，雖然 JavaScript 基礎的複習是可累積的，但如果能再重來一次的話，我會建議自己專注某一個技術就好。畢竟除了技術之外，還要研究對方產業的 domain knowledge。<br><br>
        我總共規劃了 4 個求職 phase。第二階段的一半，在面試了大大小小的公司後，我已是筋疲力盡魂飛魄散，當時雖有拿到一個 offer，但對於地點不甚滿意，也在等其他我更有興趣的公司的二階三階面試。就在我打算休息一個週末，再繼續謀職時，10 月 22 日收到一位 CEO 的 Cake 私訊，問我有沒有興趣去聊一聊。週一上午我帶著一杯路易莎的綠茶，一見面就很白目的跟人家說既然是聊聊不如咱輕鬆點 😂 <br><br>
        面試的過程，可以說是相談甚歡。這家公司目前在開發的產品很有趣，前後端都可以碰到，我覺得我可以在這裡發揮我的價值、並且沒碰過的技術也接受我邊做邊學，這對我來說是個很好的機會。我記得我在前公司跟前前公司的面試時的感覺，面試完的踏實感，沒有那種怪怪毛毛的感覺，在這家公司的面試完的感覺也是一樣的。最後我獲得了一個全端軟體工程師的職位，嗯哼，Full-stack baby！當場就把薪資談好，約定好了上工日期。<br><br>
        </p>
        <p>
          回想起這一年多來轉職的過程，從「反正寫程式這個技能學了不虧」的起心動念，一些免費的資源開始，到報名 coding camp，一天天的打卡學習，學到罵髒話學到哭，覺得自己是世界第一大笨蛋，學到擺爛，耍廢好幾天再認份的回到電腦前，到真的拿到 offer，尤其是 2023 AI 突然長成超大果實走進大眾的生活裡，你知道的，突然轉職軟體工程師這件事變得很不性感，ALPHA camp 甚至在 2024 年 11 月不敵 AI 狂潮倒店了（我會是 AC 最後一個轉職成功的末代武士嗎？），0 → 1 的過程是最費勁的，想生火，要找柴，要點火，木頭濕或是風向亂了，一不小心就要重來。現在火已經點著了，也學會怎麼規劃學習、落實學習，接下來繼續帶策略的添柴火，至於 1 → 87 ，我話先不要說太滿，畢竟也才剛離開新手村而已。
        </p>

    </div>
  </main>
</template>
<script setup lang="ts">
  import HeroBanner from '../../../components/HeroBanner.vue'
</script>

<style scoped lang="scss">
  .article-container {
    width: 80%;
    max-width: 780px;
    margin: 0 auto;
    padding: 2rem;
    padding-bottom: 100px;

    & .note {
      font-size: 0.7rem;
    }

    img {
      margin: 0 auto;
    }
  }
</style>
