[
  {
    "title": "牧羊少年奇幻之旅",
    "author": "Paulo Coelho",
    "category": "Fiction",
    "cover": "https://res.cloudinary.com/dube3xzga/image/upload/v1750514857/resize_ddvwkv.jpg",
    "note": "牧羊少年的旅程，看似在追尋寶藏，其實是回到自己內心的過程。我感受最深的就是活在當下、去觀察生活周遭的事物、去傾聽內在的聲音、勇敢的順著內心和直覺去追求天命。書裡有一句最出名的話：「當你真心渴望某樣東西時，整個宇宙都會聯合起來幫助你實現它。」以這個浪漫的比喻，作為一種生活的信念系統，讓我在迷惘時依然保持行動與信任。牧羊少年就像我們每個人追尋人生使命的縮影。以及尋遍世界才懂得：我們不是要找到什麼，而是要回到那個原本純粹的自己。"
  },
  {
    "title": "當下的力量",
    "author": "Eckhart Tolle",
    "category": "Self-help",
    "cover": "https://res.cloudinary.com/dube3xzga/image/upload/v1750511104/20230218134827692709_oxlmtj.jpg",
    "note": "咱人類大多數的痛苦，其實來自對過去的執著和對未來的焦慮，而真正的寧靜，只存在當下。覺察自己的念頭，就是醒著、活著。早些年閱讀這本書時難以共鳴。我想或許是因為那時的日子還不夠苦(?)，又或者是譯者的靈學素養，許多關鍵詞之於我是生澀的，例如「臨在」、「本體」、「靜默寂照」，當時的我無法消化這些文字。隨著人生有了更多經驗與體悟，再次閱讀，搭配 ChatGPT 分析原文的用詞與語境，逐漸對照出作者想表達的內容。隨著層層深入的引導與提問，我開始看見「You are not your mind」這句話背後的深意，並對於執念、情緒、焦慮這些心智（Mind）所製造的幻象，慢慢產生距離感。這本書是要你用「當下的覺知」去經驗。這份覺知其實我們一直都有，只是被習慣性的念頭聲音蓋住了。真正的轉化，不是摧毀心智，而是讓「被心智控制」的自我，慢慢鬆手，讓位給一個更寧靜、清明的存在狀態。想來 Sadguru 的 Isha Kriya 冥想不斷複誦的 “I am not the body, I am not even the mind.” 目的也是一樣的吧，它們都在引導我們「覺察」那個比身體和心智（mind）更深的存在本質，純粹的「覺知者」、「臨在」(Presence)。"
  },
  {
    "title": "湖濱散記",
    "author": "Henry David Thoreau",
    "category": "Philosophy",
    "cover": "https://res.cloudinary.com/dube3xzga/image/upload/v1750511104/20200927032103690904_turbb5.webp",
    "note": "一本隱居生活的紀錄，也是對現代生活節奏的深度質疑。梭羅的筆調樸實卻深刻，讓我開始思考：活得簡單，是不是更接近自由？是不是能更接近真實的自我？而有趣的是，在 Cal Newport 的著作《Digital Minimalism》中我讀到：梭羅在湖邊的許多生活方式，根本不算是與世隔絕。原來梭羅的小屋不是在樹林深處，而是在樹林邊緣的一片空地上，那裡甚至可以看到一條人來人往的公路。小屋距離他的家鄉康科特（Concord）只有 30 分鐘的腳程，他常常回鎮上吃飯、應酬，朋友與家人也時常到小屋造訪他。但是，某種意義上來說，或許真正的簡樸，從來就不是與世界斷絕往來，而是選擇什麼該留下、什麼該放下的自由。"
  },
  {
    "title": "少，但是更好",
    "author": "Greg McKeown",
    "category": "Productivity",
    "cover": "https://res.cloudinary.com/dube3xzga/image/upload/v1750511104/20211223034228970732_a9wk6e.webp",
    "note": "這本書主張專準主義（Essentialism）的思維模式，透過辨別真正重要的事，全心投入，並有勇氣拒絕次要任務，避免落入瞎忙的狀態。因為我們時間和能量都很有限，這本書提供簡化日常瑣事的方法，把心力留給真正有價值的事情，透過降低執行過程中的阻力，讓每一次專注的的可持續性拉高，提升生產力。"
  },
  {
    "title": "學習如何學習",
    "author": "Barbara Oakley",
    "category": "Learning",
    "cover": "https://res.cloudinary.com/dube3xzga/image/upload/v1750511104/ec1717458_jcvqzi.webp",
    "note": "這本書將認知科學轉譯成淺白又實用的學習技巧，除了作者群裡自己本身的故事於我能產生共鳴之外，裡頭基於科學證實可行的方法論全數受用，像是間隔學習、切換模式、情緒管理等。我最喜歡的是注意力章魚，作者用四隻腳的章魚說明大腦神經連結如何從你初學到精通，行程連結組的過程，推薦給正在培育國家未來棟樑的新手父母或任何想學習新事物卻沒自信的人類。"
  },
  {
    "title": "Rewire 神經可塑性",
    "author": "Richard O'Connor",
    "category": "Psychology",
    "cover": "https://res.cloudinary.com/dube3xzga/image/upload/v1750511104/168_115039920_129_mainCoverImage1_vmdy8r.webp",
    "note": "這本書幫助我理解了『即使已成年，仍能改變自己』背後的神經科學依據。作者強調改變習慣不是靠意志力，而是透過有意識的練習與替代反應的建立，逐步重塑大腦路徑。對我而言，它像是一份操作手冊，教我如何從舊有的反應模式中抽身、觀察、重建，讓自我成長從抽象變得具體。"
  }
]
